---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsCrossingRisersDisallowedFailure
source: html/b84cea77-a029-2941-bf2c-4ec5e7214e8b.htm
---
# Autodesk.Revit.DB.BuiltInFailures.StairRampFailures.StairsCrossingRisersDisallowedFailure Property

Crossing risers are not allowed

## Syntax (C#)
```csharp
public static FailureDefinitionId StairsCrossingRisersDisallowedFailure { get; }
```